In [1]:
import pandas as pd

In [2]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [4]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [6]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [7]:
df1.shape

(7, 3)

In [12]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [13]:
df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [14]:
 df1["Gender"].unique()

array(['Male', 'Female'], dtype=object)

In [15]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

# display rows where people having marks greater than 90 and less than 100

In [19]:
df1[df1['Marks']>90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [28]:
df1[(df1["Marks"]>=90) & (df1["Marks"]<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [27]:
len(df1[df1['Marks'].between(90,100)])

4

find avg marks

In [34]:
df1['Marks'].mean()

92.14285714285714

#  Apply function

In [35]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [36]:
def Marks(x):
    return x/2;

In [37]:
df1['Marks'].apply(Marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [39]:
#create new column for avg marks 
df1['halfmark']=df1['Marks'].apply(Marks)

In [40]:
df1

      Name  Marks  Gender  halfmark
0  Priyang     98    Male      49.0
1   Aadhya     89  Female      44.5
2   Krisha     99  Female      49.5
3   Vedant     87    Male      43.5
4   Parshv     90    Male      45.0
5   Mittal     83  Female      41.5
6  Archana     99  Female      49.5

In [43]:
#using of lambda function 
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [44]:
#display length of the names 
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [50]:
#map functions  //we need to convert male to 1 and female to 0
df1['Gender'].map({'Male':1,'Female':0})

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender, dtype: int64

In [54]:
#add new column 
df1['male_female']=df1['Gender'].map({'Male': 1,"Female":2})

In [55]:
df1

      Name  Marks  Gender  halfmark  male_female
0  Priyang     98    Male      49.0            1
1   Aadhya     89  Female      44.5            2
2   Krisha     99  Female      49.5            2
3   Vedant     87    Male      43.5            1
4   Parshv     90    Male      45.0            1
5   Mittal     83  Female      41.5            2
6  Archana     99  Female      49.5            2

In [58]:
#drop column(s)                       //if you want to delete more then 2 columns then you have to write it inside the list 
df1.drop(['halfmark','male_female'],axis=1,inplace=True)

In [59]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [61]:
#sort df based on marks 
df1.sort_values(by="Marks",ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [66]:
#display name of female student only 
df1[df1['Gender']=="Female"]['Name']

1     Aadhya
2     Krisha
5     Mittal
6    Archana
Name: Name, dtype: object

In [69]:
#display name and Marks of female student only 
df1[df1['Gender']=="Female"][['Name',"Marks"]]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99